In [ ]:
import pandas as pd
import sqlite3

In [ ]:
# Conectamos con la base de datos
connection = sqlite3.connect("data/my_database2.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [ ]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

In [ ]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [ ]:
query = '''
CREATE TABLE cervezas (
    CodC VARCHAR(2),
    Envase VARCHAR(32),
    Capacidad FLOAT(2),
    Stock INT(5),
    PRIMARY KEY (CodC)
)
'''

crsr.execute(query)

In [ ]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
# query = '''
# DROP TABLE cervezas 
# '''
# crsr.execute(query)

In [ ]:
query = '''
INSERT INTO Cervezas (CodC, Envase, Capacidad, Stock)
VALUES ('01','Botella',0.2,3600)
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
query = '''
INSERT INTO Cervezas VALUES ('02','Botella',0.33,1200)
'''
crsr.execute(query)

In [ ]:
query = '''
INSERT INTO Cervezas VALUES ('03','Lata',0.33,2400),
('04','Botella',1,288),
('05','Barril',60,30)
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
query = '''
INSERT INTO Cervezas VALUES ('06','asas','asas','asas')
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
query = '''
DELETE FROM Cervezas WHERE CodC="06"
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

## DataFame a BD sql

[pandas.DataFrame.to_sql](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
query = '''
UPDATE cervezas
SET Stock = 5000, Capacidad = 0.25
WHERE CodC='02';
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

In [ ]:
query = '''
DELETE FROM cervezas WHERE CodC='05';
'''
crsr.execute(query)

In [ ]:
query = '''
SELECT * FROM cervezas
'''
df = sql_query(query)
df

In [ ]:
df.to_sql("cervezas_nueva", connection, index=False)

In [ ]:
query = '''
SELECT * FROM cervezas_v2
'''
df = sql_query(query)
df

## SUBQUERIES

In [ ]:
query = '''
SELECT * FROM (SELECT * FROM Cervezas WHERE Envase="Botella")
'''
sql_query(query)

In [ ]:
# ATENCIÓN! Al terminar hay que cerrar la conexión a la DB para que se guarden los cambios!!!!!!
connection.commit()
connection.close()

# Resolución ejercicio

In [97]:
# Conectamos con la base de datos
connection = sqlite3.connect("data/my_database3.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [98]:
#query = '''
#DROP TABLE cervezas_v2
#'''

#crsr.execute(query)

In [99]:
#query = '''
#DROP TABLE cervezas
#'''

#crsr.execute(query)

In [100]:
query = '''
CREATE TABLE cervezas (
    CodC VARCHAR(2),
    Envase VARCHAR(32),
    Capacidad FLOAT(2),
    Stock INT(5),
    PRIMARY KEY (CodC)
)
'''

crsr.execute(query)

In [101]:
query = '''
INSERT INTO cervezas VALUES ('01','Botella',0.2,3600),
('02','Botella',0.33,1200),
('03','Lata',0.33,2400),
('04','Botella',1,288),
('05','Barril',60,30)
'''
crsr.execute(query)

In [102]:
query = '''
CREATE TABLE bares (
	CodB VARCHAR(3) NOT NULL,
    Nombre VARCHAR,
    Cif VARCHAR,
	Localidad VARCHAR,
	PRIMARY KEY (CodB)
);
'''
crsr.execute(query)

In [103]:
query = '''
INSERT INTO bares (CodB, Nombre, Cif, Localidad) 
VALUES  ('001','Stop','11111111X','Villa Botijo'),
('002','Las Vegas','22222222Y','Villa Botijo'),
('003','Club Social',NULL,'Las Ranas'),
('004','Otra Ronda','33333333X','La Esponja')
;
'''
crsr.execute(query)

In [104]:
query = '''
CREATE TABLE empleados (
	CodE INT NOT NULL,
    Nombre VARCHAR,
    Sueldo INT,
	PRIMARY KEY (CodE)
);
'''
crsr.execute(query)

In [105]:
query = '''
INSERT INTO empleados (CodE, Nombre, Sueldo) 
VALUES  (1,'Prudencio Caminero', 120000),
(2,'Vicente Merario', 110000),
(3,'Valentin Siempre', 100000)
;
'''
crsr.execute(query)

In [106]:
query = '''
CREATE TABLE reparto (
	CodE VARCHAR(2) NOT NULL,
	CodB VARCHAR(3) NOT NULL,
	CodC VARCHAR(2) NOT NULL,
	Fecha DATE NOT NULL,
	Cantidad SMALLINT,
	PRIMARY KEY (CodE,CodB,CodC)
	FOREIGN KEY (CodC) REFERENCES cervezas(CodC)
	FOREIGN KEY (CodB) REFERENCES bares(CodB)
	FOREIGN KEY (CodE) REFERENCES empleados(CodE)
);
'''
crsr.execute(query)

In [107]:
query = '''
INSERT INTO reparto (CodE, CodB, CodC, Fecha, Cantidad) 
VALUES  ('1','001','01','2005-10-21',240 ),
( '1','001','02','2005-10-21',48 ),
( '1','002','03','2005-10-22',60 ),
( '1','004','05','2005-10-22',4 ),
( '2','002','03','2005-10-22',48 ),
( '2','002','05','2005-10-23',2 ),
( '2','004','01','2005-10-23',480 ),
( '2','004','02','2005-10-24',72 ),
( '3','003','03','2005-10-24',48 ),
( '3','003','04','2005-10-25',20 )
;
'''
crsr.execute(query)

In [108]:
query = '''
SELECT * FROM reparto
;
'''
df = sql_query(query)
df

  CodE CodB CodC       Fecha  Cantidad
0    1  001   01  2005-10-21       240
1    1  001   02  2005-10-21        48
2    1  002   03  2005-10-22        60
3    1  004   05  2005-10-22         4
4    2  002   03  2005-10-22        48
5    2  002   05  2005-10-23         2
6    2  004   01  2005-10-23       480
7    2  004   02  2005-10-24        72
8    3  003   03  2005-10-24        48
9    3  003   04  2005-10-25        20

In [109]:
df.to_sql('repartos_bis', con=connection, if_exists="replace", index=False)

10

In [110]:
query = '''
SELECT * FROM repartos_bis
;
'''
df = sql_query(query)
df

  CodE CodB CodC       Fecha  Cantidad
0    1  001   01  2005-10-21       240
1    1  001   02  2005-10-21        48
2    1  002   03  2005-10-22        60
3    1  004   05  2005-10-22         4
4    2  002   03  2005-10-22        48
5    2  002   05  2005-10-23         2
6    2  004   01  2005-10-23       480
7    2  004   02  2005-10-24        72
8    3  003   03  2005-10-24        48
9    3  003   04  2005-10-25        20

In [111]:
# query = '''
# DROP TABLE cervezas 
# '''
# crsr.execute(query)

# query = '''
# DROP TABLE bares 
# '''
# crsr.execute(query)

# query = '''
# DROP TABLE empleados 
# '''
# crsr.execute(query)

# query = '''
# DROP TABLE reparto 
# '''
# crsr.execute(query)

In [112]:
connection.commit()
connection.close()